#include <iostream>
// Перша програма написана на курсі Сі++ ITEA
/*
 * Вчу наново C++
 * Та освоюю Git
 * 
 * Для компіляції коритуватися консоллю команда
 * Clang++ -Wall -Wpedantic -std=c++17 hello.cpp
 * На виході отримаємо виконуваний файл a.out
 * */
int main()
{
    /* вітаємося */
	std::cout<<"Hello World!"<<std::endl;
    /* Повідомляємо що будемо робтити*/
    std::cout<<"Test writing numbers."<<std::endl;
    /*Виведемо на екран число 25 у різних формах запису
    тобто що вийде якщо ми різними формами запису виведемо якесь число
    використуовючи 25. Десяткова, вісімова та шісндцятирична ситеми 
    дозволять вткористовувати "2" та "5". Чому вбрані ці числа... Рандомні значення.
    Тільки двійкове число не дозволяє використи такі знаки*/
    //не магічне 25 в 10
    std::cout<<"Print number 25: "<<25<<std::endl;
    //магічне 25 в 16
    std::cout<<"Print hex 0x25: "<<0x25<<std::endl;
    //магічне 25 в 8
    std::cout<<"Print oct 025: "<<025<<std::endl;
    //бінарне
    std::cout<<"Print bin b01001000:"<<b01001000<<std::endl;
	return 0;
}
